#include "Variation6.h"



/*

Variation 6

	Instructions

		1. Take the alphabet made of the letters considered the most beautiful (from this project, based on 100k votes)

		2. Replace every symbol with its corresponding beautiful letter

*/

ଳɚಳට ജฝ٧ಳฝᎲಳɚෂ6::ᖗᕓᓎᓎɚ௵ɚ٧ᓎට()
{
		ඹ٧ಳෂᎲᓗ("ᖗᕓᓎᓎɚ, ௵ɚ٧ᓎට!\n");
}

ಳෂᎲ ജฝ٧ಳฝᎲಳɚෂ6::_99ҜɚᎲᎲᓎᕓҀ()
{
	ಳෂᎲ ळɚᎲᎲᓎᕓᗑɚᾦෂᎲ = 99;

	ටɚ
	{
		ҀٮಳᎲತɷ(ळɚᎲᎲᓎᕓᗑɚᾦෂᎲ)
		{
		ತฝҀᕓ 0:
			ඹ٧ಳෂᎲᓗ("ෂɚ ᖘɚ٧ᕓ ळɚᎲᎲᓎᕓҀ ɚᓗ ळᕓᕓ٧ ɚෂ Ꮂɷᕓ ٮฝᓎᓎ, ෂɚ ᖘɚ٧ᕓ ळɚᎲᎲᓎᕓҀ ɚᓗ ळᕓᕓ٧.\n");
			ඹ٧ಳෂᎲᓗ("௵ᕓෂᎲ Ꮂɚ Ꮂɷᕓ ҀᎲɚ٧ᕓ ฝෂට ळᾦห Ҁɚᖘᕓ ᖘɚ٧ᕓ, 99 ळɚᎲᎲᓎᕓҀ ɚᓗ ळᕓᕓ٧ ɚෂ Ꮂɷᕓ ٮฝᓎᓎ.\n\n");
			ळ٧ᕓฝโ;
		ತฝҀᕓ 1:
			ඹ٧ಳෂᎲᓗ("1 ळɚᎲᎲᓎᕓ ɚᓗ ळᕓᕓ٧ ɚෂ Ꮂɷᕓ ٮฝᓎᓎ, 1 ळɚᎲᎲᓎᕓ ɚᓗ ळᕓᕓ٧.\n");
			ඹ٧ಳෂᎲᓗ("ᑓฝโe ɚෂe ටɚ٧ෂ ฝෂට ඹฝҀҀᕓට ಳᎲ ฝ٧ɚᾦෂට, ෂɚ ᖘɚ٧ᕓ ळɚᎲᎲᓎᕓҀ ɚᓗ ळᕓᕓ٧ ɚෂ Ꮂɷᕓ ٮฝᓎᓎ.\n\n");
			ळ٧ᕓฝโ;
		ತฝҀᕓ 2:
			ඹ٧ಳෂᎲᓗ("2 ळɚᎲᎲᓎᕓҀ ɚᓗ ळᕓᕓ٧ ɚෂ Ꮂɷᕓ ٮฝᓎᓎ, 2 ळɚᎲᎲᓎᕓҀ ɚᓗ ळᕓᕓ٧.\n");
			ඹ٧ಳෂᎲᓗ("ᑓฝโe ɚෂe ටɚ٧ෂ ฝෂට ඹฝҀҀ ಳᎲ ฝ٧ɚᾦෂට, 1 ᖘɚ٧ᕓ ळɚᎲᎲᓎᕓ ɚᓗ ळᕓᕓ٧ ɚෂ Ꮂɷᕓ ٮฝᓎᓎ.\n\n"); 
			ळ٧ᕓฝโ;
		ටᕓᓗฝᾦᓎᎲ:
			ඹ٧ಳෂᎲᓗ("%d ळɚᎲᎲᓎᕓҀ ɚᓗ ळᕓᕓ٧ ɚෂ Ꮂɷᕓ ٮฝᓎᓎ, %d ळɚᎲᎲᓎᕓҀ ɚᓗ ळᕓᕓ٧.\n", ळɚᎲᎲᓎᕓᗑɚᾦෂᎲ, ळɚᎲᎲᓎᕓᗑɚᾦෂᎲ);
			ඹ٧ಳෂᎲᓗ("ᑓฝโe ɚෂe ටɚ٧ෂ ฝෂට ඹฝҀҀ ಳᎲ ฝ٧ɚᾦෂට, %d ळɚᎲᎲᓎᕓҀ ɚᓗ ळᕓᕓ٧ ɚෂ Ꮂɷᕓ ٮฝᓎᓎ.\n\n", ळɚᎲᎲᓎᕓᗑɚᾦෂᎲ - 1);
		}
		ळɚᎲᎲᓎᕓᗑɚᾦෂᎲ--;

	} ٮɷಳᓎᕓ(ळɚᎲᎲᓎᕓᗑɚᾦෂᎲ >= 0);

	٧ᕓᎲᾦ٧ෂ 0;
}
